In [6]:
# Import MySQL Connector/Python 
import mysql.connector as connector

connection=connector.connect(user="root",password="excellent123")

In [7]:
cursor = connection.cursor()

In [8]:
cursor.execute("CREATE DATABASE IF NOT EXISTS little_lemon_db")

In [9]:
cursor.execute("USE little_lemon_db")

In [17]:
#MenuItems table
create_menuitem_table = """CREATE TABLE IF NOT EXISTS MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""

create_menu_table = """CREATE TABLE IF NOT EXISTS Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""

create_booking_table = """CREATE TABLE IF NOT EXISTS Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""

create_orders_table = """CREATE TABLE IF NOT EXISTS Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""

create_employees_table = """CREATE TABLE IF NOT EXISTS Employees (
EmployeeID INT AUTO_INCREMENT PRIMARY KEY,
Name VARCHAR(255),
Role VARCHAR(255),
Address VARCHAR(255),
Contact_Number INT,
Email VARCHAR(255),
Annual_Salary VARCHAR(255)
);"""

In [18]:
# Create MenuItems table
cursor.execute(create_menuitem_table)

# Create Menu table
cursor.execute(create_menu_table)

# Create Bookings table
cursor.execute(create_booking_table)

# Create Orders table
cursor.execute(create_orders_table)

# Create Employees table
cursor.execute(create_employees_table)

In [22]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary) VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

In [24]:
# Populate MenuItems table
cursor.execute(insert_menuitems)
connection.commit()

# Populate MenuItems table
cursor.execute(insert_menu)
connection.commit()

# Populate Bookings table
cursor.execute(insert_bookings)
connection.commit()

# Populate Orders table
cursor.execute(insert_orders)
connection.commit()

# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

In [45]:
from mysql.connector.pooling import MySQLConnectionPool
from mysql.connector import Error

dbconfig = {
    "user": "root",
    "password": "excellent123",
    "database": "little_lemon_db"
}

In [46]:
try:
    pool_a = MySQLConnectionPool(pool_name="pool_a", pool_size=2, **dbconfig)
    print("The connection pool is created with a name: ",pool_a.pool_name)
    print("The pool size is:",pool_a.pool_size)
    
except Error as er:
    print("Error code:", er.errno)
    print("Error message:", er.msg)

The connection pool is created with a name:  pool_a
The pool size is: 2

In [47]:
from mysql.connector import connect
connection = connect(**dbconfig)
cursor = connection.cursor()

In [90]:
create_peakhours_procedure = """
CREATE PROCEDURE IF NOT EXISTS PeakHours()
BEGIN
    SELECT HOUR(BookingSlot) AS Hour, COUNT(*) AS NumBookings
    FROM Bookings
    GROUP BY Hour
    ORDER BY NumBookings DESC;
END;
"""

In [91]:
cursor.execute(create_peakhours_procedure)
connection.commit()

In [92]:
cursor.callproc("PeakHours")

()

In [93]:
for result in cursor.stored_results():
    dataset = result.fetchall()

In [94]:
dataset

[(19, 2), (15, 1), (17, 1), (18, 1), (20, 1)]

In [96]:
column_names = [column[0] for column in result.description]

In [97]:
print("Column names:")
for name in column_names:
    print(name)

Column names:
Hour
NumBookings

In [98]:
print("Sorted data:")
for row in dataset:
    print(row)

Sorted data:
(19, 2)
(15, 1)
(17, 1)
(18, 1)
(20, 1)

In [114]:
create_guest_status_procedure = """
CREATE PROCEDURE GuestStatus()
BEGIN
SELECT CONCAT(Bookings.GuestFirstName, ' ', Bookings.GuestLastName) AS GuestName,
CASE
WHEN Employees.Role IN ('Manager', 'Assistant Manager') THEN 'Ready to pay'
WHEN Employees.Role = 'Head Chef' THEN 'Ready to serve'
WHEN Employees.Role = 'Assistant Chef' THEN 'Preparing Order'
WHEN Employees.Role = 'Head Waiter' THEN 'Order served'
END AS OrderStatus
FROM Bookings
LEFT JOIN Employees ON Employees.EmployeeID = Bookings.EmployeeID;
END
"""

In [115]:
cursor.execute("""DROP PROCEDURE IF EXISTS GuestStatus""")

In [116]:
cursor.execute(create_guest_status_procedure)
connection.commit()

In [117]:
cursor.callproc("GuestStatus")

()

In [118]:
for result in cursor.stored_results():
    dataset = result.fetchall()

In [119]:
column_names = [column[0] for column in result.description]

In [120]:
print("Column names:")
for name in column_names:
    print(name)

Column names:
GuestName
OrderStatus

In [121]:
print("Sorted data:")
for row in dataset:
    print(row)

Sorted data:
('Anna Iversen', 'Ready to pay')
('Joakim Iversen', 'Ready to pay')
('Vanessa McCarthy', 'Ready to serve')
('Marcos Romero', 'Preparing Order')
('Hiroki Yamane', 'Ready to pay')
('Diana Pinto', 'Order served')

In [122]:
cursor.close()
connection.close()

In [129]:
try:
    pool_b = MySQLConnectionPool(pool_name="pool_b", pool_size=2, **dbconfig)
    print("The connection pool is created with a name:", pool_b.pool_name)
    print("The pool size is:", pool_b.pool_size)

except Error as err:
    print("Error code:", err.errno)
    print("Error message:", err.msg)

The connection pool is created with a name: pool_b
The pool size is: 2

In [160]:
from mysql.connector import Error

try:
    connection1 = pool_b.get_connection()
    query1 = """
    INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) 
    VALUES (8, 'Anees', 'Java', '18:00', 6);
    """    
    cursor1 = connection1.cursor()
    cursor1.execute(query1)
    connection1.commit()
    cursor1.close()
    print("Q1 END")

    connection2 = pool_b.get_connection()
    query2 = """
    INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) 
    VALUES (5, 'Bald', 'Vin', '19:00', 6);
    """
    cursor2 = connection2.cursor()
    cursor2.execute(query2)
    connection2.commit()
    cursor2.close()
    print("Q2 END")
    
    connection3 = pool_b.get_connection()
    query3 = """
    INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) 
    VALUES (12, 'Jay', 'Kon', '19:30', 6);
    """
    cursor3 = connection3.cursor()
    cursor3.execute(query3)
    connection3.commit()
    cursor3.close()

    connection1.close()
    connection2.close()
    connection3.close()
    print("ALL END")

except Error as err:
    print("Error code:", err.errno)
    print("Error message:", err.msg)

Q1 END
Q2 END
Error code: -1
Error message: Failed getting connection; pool exhausted

In [177]:
# connection1.close()
# connection2.close()
# connection3.close()
# print("CLOSE ALL")

In [157]:
from mysql.connector import Error

try:
    connection1 = pool_b.get_connection()
    query1 = """
    INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) 
    VALUES (8, 'Anees', 'Java', '18:00', 6);
    """    
    cursor1 = connection1.cursor()
    cursor1.execute(query1)
    connection1.commit()
    cursor1.close()
    print("Q1 END")

    connection2 = pool_b.get_connection()
    query2 = """
    INSERT INTO Bookings (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID) 
    VALUES (5, 'Bald', 'Vin', '19:00', 6);
    """
    cursor2 = connection2.cursor()
    cursor2.execute(query2)
    connection2.commit()
    cursor2.close()
    print("Q2 END")

    connection1.close()
    connection2.close()
    print("ALL END")

except Error as err:
    print("Error code:", err.errno)
    print("Error message:", err.msg)

Q1 END
Q2 END
ALL END

In [202]:
connection = pool_b.get_connection()
cursor = connection.cursor()

In [203]:
query1 = """SELECT Name, EmployeeID FROM Employees WHERE Role = 'Manager' LIMIT 1"""
cursor.execute(query1)
manager = cursor.fetchone()

In [204]:
manager

('Mario Gollini', 1)

In [205]:
query2 = "SELECT Name, Role FROM Employees WHERE Annual_Salary = (SELECT MAX(Annual_Salary) FROM Employees) LIMIT 1"
cursor.execute(query2)
highest_salary_employee = cursor.fetchone()

In [206]:
query3 = "SELECT COUNT(*) FROM Bookings WHERE BookingSlot BETWEEN '18:00' AND '20:00'"
cursor.execute(query3)
guests_booked_count = cursor.fetchone()[0]

In [208]:
query4 = "SELECT CONCAT(GuestFirstName, ' ', GuestLastName) AS Fullname, BookingID FROM Bookings ORDER BY BookingSlot"
cursor.execute(query4)
waiting_guests = cursor.fetchall()

In [209]:
print("Little Lemon Manager:")
print("Name:", manager[0])
print("EmployeeID:", manager[1])

print("\nEmployee with the highest salary:")
print("Name:", highest_salary_employee[0])
print("Role:", highest_salary_employee[1])

print("\nNumber of guests booked between 18:00 and 20:00:", guests_booked_count)

print("\nGuests waiting to be seated:")
for guest in waiting_guests:
    print("Fullname:", guest[0])
    print("BookingID:", guest[1])
    print()

Little Lemon Manager:
Name: Mario Gollini
EmployeeID: 1

Employee with the highest salary:
Name: Mario Gollini
Role: Manager

Number of guests booked between 18:00 and 20:00: 16

Guests waiting to be seated:
Fullname: Vanessa McCarthy
BookingID: 3

Fullname: Marcos Romero
BookingID: 4

Fullname: Anees Java
BookingID: 7

Fullname: Anees Java
BookingID: 9

Fullname: Anees Java
BookingID: 11

Fullname: Anees Java
BookingID: 12

Fullname: Anees Java
BookingID: 13

Fullname: Anees Java
BookingID: 15

Fullname: Anees Java
BookingID: 17

Fullname: Hiroki Yamane
BookingID: 5

Fullname: Anna Iversen
BookingID: 1

Fullname: Joakim Iversen
BookingID: 2

Fullname: Bald Vin
BookingID: 8

Fullname: Bald Vin
BookingID: 10

Fullname: Bald Vin
BookingID: 14

Fullname: Bald Vin
BookingID: 16

Fullname: Bald Vin
BookingID: 18

Fullname: Diana Pinto
BookingID: 6

In [223]:
create_BasicSalesReport = """
CREATE PROCEDURE BasicSalesReport()
BEGIN
SELECT 
SUM(BillAmount) AS `Total Sales`,
AVG(BillAmount) AS `Average Sale`,
MIN(BillAmount) AS `Minimum Bill Paid`,
MAX(BillAmount) AS `Maximum Bill Paid`
FROM 
Orders;
END
"""

In [222]:
# cursor.execute("""Drop Procedure BasicSalesReport""")

In [224]:
cursor.execute(create_BasicSalesReport)
connection.commit()

In [225]:
cursor.callproc("BasicSalesReport")

()

In [230]:
for result in cursor.stored_results():
    dataset = result.fetchall()

In [231]:
dataset

[(Decimal('243'), Decimal('48.6000'), 37, 86)]

In [234]:
print("Total Sales:", dataset[0][0])
print("Average Sale:", dataset[0][1])
print("Minimum Bill Paid:", dataset[0][2])
print("Maximum Bill Paid:", dataset[0][3])

Total Sales: 243
Average Sale: 48.6000
Minimum Bill Paid: 37
Maximum Bill Paid: 86

In [235]:
if connection.is_connected():
        cursor.close()
        connection.close()

In [239]:
try:
    pool_b = MySQLConnectionPool(pool_name="pool_b", pool_size=2, **dbconfig)
    print("The connection pool is created with a name: ",pool_b.pool_name)
    print("The pool size is:",pool_b.pool_size)
    connection = pool_b.get_connection()
    cursor = connection.cursor(buffered=True)

    query = """
    SELECT b.BookingSlot, CONCAT(b.GuestFirstName, ' ', b.GuestLastName) AS GuestName, CONCAT(e.Name, ' [', e.Role, ']') AS AssignedTo
    FROM Bookings b
    INNER JOIN Employees e ON b.EmployeeID = e.EmployeeID
    ORDER BY b.BookingSlot ASC
    LIMIT 3
    """
    cursor.execute(query)

    results = cursor.fetchall()

    for row in results:
        booking_slot = row[0]
        guest_name = row[1]
        assigned_to = row[2]

        print("BookingSlot:", booking_slot)
        print("\tGuest_name:", guest_name)
        print("\tAssigned to:", assigned_to, "\n")
        

except mysql.connector.Error as error:
    print("Error code:", er.errno)
    print("Error message:", er.msg)


finally:
    if connection.is_connected():
        cursor.close()
        connection.close()

The connection pool is created with a name:  pool_b
The pool size is: 2
BookingSlot: 15:00:00
	Guest_name: Vanessa McCarthy
	Assigned to: Giorgos Dioudis [Head Chef]

BookingSlot: 17:30:00
	Guest_name: Marcos Romero
	Assigned to: Fatma Kaya [Assistant Chef]

BookingSlot: 18:00:00
	Guest_name: Anees Java
	Assigned to: John Millar [Receptionist]